Revit 2027 API
VertexIndexPairArrayIterator.Current Property
Retrieves the item that is the current focus of the iterator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Object Current { get; }
Public Overridable ReadOnly Property Current As Object
	Get
public:
virtual property Object^ Current {
	Object^ get ();
}
abstract Current : Object with get
override Current : Object with get
Property Value
Object
Implements
IEnumerator.Current
Remarks
 A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.
See Also
Reference
VertexIndexPairArrayIterator Class
Autodesk.Revit.DB Namespace